"""Квадратное уравнение 🌶️🌶️
Даны три вещественных числа aa, bb, cc. Напишите программу, которая находит вещественные корни квадратного уравнения 
ax^2 + bx + c = 0.
ax 
2
 +bx+c=0.
Формат входных данных
На вход программе подается три вещественных числа a \neq 0, \, b, \, ca

=0,b,c, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.

Примечание. Если уравнение имеет два корня, то следует вывести их в порядке возрастания.
"""



import math
a,b,c = float(input()),float(input()),float(input())
D = b**2-4*a*c
if D > 0:
    x = (((-b+math.sqrt(D))/(2*a)),((-b-math.sqrt(D))/(2*a)))
    print(min(x))
    print(max(x))        
elif D == 0:
    print(-b/(2*a))
else:
    print("Нет корней")